package pro.sky.sheltertelegrambot.command;

/**
 * Тексты для меню разных этапов
 */
public class TextMenu {
    public static final String TEXT_MENU_ONE =
            """
                    Отправьте команду если вы хотите:
                    - Узнать информацию о приюте - ???
                    - Как взять животное из приюта - ???
                    - Прислать отчет о питомце - ???
                    - Позвать волонтера - ???""";
    public static final String TEXT_MENU_THU =
            """
                    - Рассказать о приюте - /info
                    - Выдать расписание работы приюта и адрес, схему проезда - /contact
                    - Выдать контактные данные охраны для оформления пропуска на машину - /pass
                    - Выдать общие рекомендации о технике безопасности на территории приюта - /safety
                    - Принять и записать контактные данные для связи - ???
                    - Позвать волонтера - ???
                    """;
    public static final String TEXT_MENU_THREE =
            """
                    - Выдать правила знакомства с животным до того, как забрать его из приюта.
                    - Выдать список документов, необходимых для того, чтобы взять животное из приюта.
                    - Выдать список рекомендаций по транспортировке животного.
                    - Выдать список рекомендаций по обустройству дома для щенка/котенка.
                    - Выдать список рекомендаций по обустройству дома для взрослого животного.
                    - Выдать список рекомендаций по обустройству дома для животного с ограниченными возможностями (зрение, передвижение).
                    - Выдать советы кинолога по первичному общению с собакой *(неактуально для кошачьего приюта, реализовать только для приюта для собак).*
                    - Выдать рекомендации по проверенным кинологам для дальнейшего обращения к ним *(неактуально для кошачьего приюта, реализовать только для приюта для собак).*
                    - Выдать список причин, почему могут отказать и не дать забрать собаку из приюта.
                    - Принять и записать контактные данные для связи.
                    - Позвать волонтера.""";
}
